import React from "react";

import campus from "../img/campus1.png";

export default function About() {
  return (
    <section className="sas-section section" id="__about">
      <h2 className="section-title">Про кафедру</h2>
      <div className="column">
        <p>
          Кафедра " Електронних Обчислювальних Машин" входит в состав факультета
          "Физики Электроники и Компьютерных систем" и уже более 10 лет является
          лидером в подготовке высококвалифицированных специалистов:
        </p>
        <p>
          первого образовательного уровня (бакалавр) по специализации
          "Комп’ютерна інженерія";
        </p>
        <p>
          второго образовательного уровня (магистр) по специализации
          "Комп’ютерна інженерія"
        </p>
        <p>
          Информационные технологии активно проникают во все сферы прикладной и
          профессиональной деятельности человека, становясь неотъемлемым
          атрибутом профессиональной пригодности в современном обществе. Одним
          из наиболее бурно развивающихся направлений информационных технологий,
          активно используемых в условиях становления информационного общества –
          информационные технологии.
        </p>
        <p>
          Информационные технологии внедряются практически во все сферы
          жизнедеятельности общества – создание продуктов для систем массовой
          информации и коммуникации; визуализация объектов глобального
          информационного пространства; развитие электронной демократии,
          электронных услуг, информационных рынков; наращивание информационного
          обмена посредством электронных социальных сетей. Это, во многом,
          объясняет востребованность специалистов, владеющих технологиями и
          системами мультимедиа в области: компьютерной обработки, анализа и
          воспроизведение цифровых изображений
        </p>
      </div>
      <h2 className="section-title">Історія кафедри</h2>
      <div className="columns">
        <div className="column is-6">
          <img src={campus} style={{ objectFit: "cover", maxHeight: 500 }} />
        </div>
        <div className="column">
          <p>
            Кафедра ЕОМ була заснована на базі кафедри біоніки фізичного
            факультету Дніпропетровського державного університету в 1976 році на
            початку широкого впровадження обчислювальної техніки в виробничу
            діяльність підприємств Придніпровського регіону. Вона є однією з
            перших кафедр цього напрямку в Україні.
          </p>
          <p>
            З 1977 року кафедра ЕОМ входить до складу радіофізичного факультету,
            а з 2007 року - до складу факультету фізики, електроніки та
            комп'ютерних систем Дніпровського національного університету імені
            Олеся Гончара
          </p>
          <p>
            За час свого існування кафедра ЕОМ підготувала понад 3000
            висококваліфікованих фахівців в області комп'ютерних систем і мереж.
            Ліцензійний обсяг – 75 бакалаврів, 50 магістрів.
          </p>
        </div>
      </div>
    </section>
  );
}
