import React from "react";

import JobPositions from "../JobPositions";
import FutureCareers from "../FutureCareers";
import SimpleCard from "./SimpleCard";

import styles from "./styles.module.css";

import infoIcon from '../../img/info.png';
import bookIcon from '../../img/book.png';
import booksIcon from '../../img/books.png';

export default function StudentEnrollment() {
  return (
    <section className="section" id="__student">
      <h2 className="section-title">Абітурієнту</h2>
      <SpecialityInfo />
      <PossibleJobRoles />
      <PossibleCompany />
    </section>
  );
}

function GeneralInformation() {
  return (
    <SimpleCard
      title="Інформація"
      iconSrc={infoIcon}
      style={{ marginLeft: 15 }}
    >
      <b>Код:</b> 123
      <br />
      <b>Форма навчання:</b> денна
      <br />
      <b>Освiтнiй рiвень:</b> бакалавр, магiстр
      <br />
      <b>Лiцензiйний обсяг:</b> бакалавр – 75, магiстр – 50
      <br />
    </SimpleCard>
  );
}

function Subjects() {
  return (
    <SimpleCard title="Предмети для вступу" iconSrc={bookIcon}>
      <b>1. Українська мова та література</b>
      <br />
      Вага предметів сертифікату: 0.2 <br />
      Мінімальна кількість балів для допуску до участі в конкурсі або для
      зарахування: 100
      <br />
      <br />
      <b>2. Математика</b>
      <br />
      Вага предметів сертифікату: 0.45 <br />
      Мінімальна кількість балів для допуску до участі в конкурсі або для
      зарахування: 100
      <br />
      <br />
      <b>3. Іноземна мова або Фізика</b>
      <br />
      Вага предметів сертифікату: 0.25
      <br /> Мінімальна кількість балів для допуску до участі в конкурсі або для
      зарахування: 100
      <br />
      <br />
      <b>4. Вага атестату про середню освіту: 0.1</b>
    </SimpleCard>
  );
}

function BachelorInfo() {
  return (
    <SimpleCard
      title="Відомості про програму навчання (бакалавр)"
      iconSrc={booksIcon}
    >
      <b>Коротка характеристика або Особливості програми підготовки</b>

      <NewLine />

      <p className={styles.paragraph}>
        Спеціальність 123 «Комп’ютерна інженерія» відноситься до галузі знань 12
        «Інформаційні технології». Стандартом вищої освіти з цієї спеціальності
        передбачено придбання студентом наступних компетентностей.
      </p>

      <p className={styles.paragraph}>
        Здатність використовувати сучасні методи і мови програмування для
        розроблення алгоритмічного та програмного забезпечення. Здатність
        створювати системне та прикладне програмне забезпечення комп’ютерних
        систем та мереж. Здатність забезпечувати захист інформації. Здатність
        розробляти та обслуговувати комп’ютерні системи та мережі, у тому числі
        мобільні та розподілені, інформаційні системи, Інтернет додатки.
        Здатність використовувати та впроваджувати нові інформаційні технології
        інтелектуальних, мобільних, безпечних обчислень, брати участь в
        модернізації комп’ютерних систем та мереж, різноманітних програмних
        додатків, Інтернет додатків з метою підвищення їх ефективності.
        Здатність системно адмініструвати, адаптувати та експлуатувати наявні
        інформаційні технології та системи. Здатність використовувати аналітичні
        методи та методи комп’ютерного моделювання при дослідженні комп’ютерних
        та інформаційних систем, у тому числі паралельних та розподілених. Надає
        право вступу на навчання за освітньою програмою магістра з комп’ютерної
        інженерії.
      </p>
      <p className={styles.paragraph}>
        <b>Професійно-орієнтовані дисципліни:</b> Програмування, Архітектура
        комп’ютерів, Організація баз даних, Системне програмування, Системне
        програмне забезпечення, Комп’ютерні мережі, Захист інформації в
        комп’ютерних системах, Інженерія програмного забезпечення, Програмні та
        інструментальні засоби web – дизайну, Програмування в операційних
        середовищах, Тестування інформаційних систем, Програмні засоби для
        створенні серверних web – додатків.
      </p>
    </SimpleCard>
  );
}

function MasterInfo() {
  return (
    <SimpleCard
      iconSrc={booksIcon}
      title={"Відомості про програму навчання (магістр)"}
    >
      <b>Коротка характеристика або Особливості програми підготовки</b>
      <NewLine />
      <p className={styles.paragraph}>
        Освітньо – професійною програмою передбачено, придбання студентом
        наступних компетентностей. Здатність до використання сучасних
        операційних систем. Здатність розробляти алгоритмічне і програмне
        забезпечення для комп’ютерних систем з паралельною та розподіленою
        архітектурою, використовувати засоби сучасних мов та бібліотек
        паралельного програмування. Здатність до дослідження і розробки
        комп’ютерних систем штучного інтелекту, організації обчислювальних
        процесів на цій основі. Здатність до розробки та реалізації сервісно –
        орієнтованих додатків і систем. Здатність проектувати віртуальні
        приватні мережі, користуватись механізмами реалізації захищених тунелів,
        проектувати магістральні домени глобальних мереж. Здатність
        використовувати програмні засоби сучасних браузерів, засобів мов
        розмітки і програмування для створення і налагодження інформаційних web
        – ресурсів. Здатність програмувати процеси та організовувати їх
        взаємодію.
      </p>
      <p className={styles.paragraph}>
        Надає право вступу на навчання за освітньо-науковою програмою підготовки
        PhD (доктор філософії з комп’ютерної інженерії).
      </p>
      <p className={styles.paragraph}>
        <b>Професійно-орієнтовані дисципліни:</b> Сучасні операційні системи,
        Інформаційна стійкість комп’ютерних технологій та мереж, Мережні
        інформаційні технології, Організація нейрокомп’ютерних систем,
        Дослідження комп’ютерних систем штучного інтелекту, Технології
        розподілених обчислень, Технології глобальних мереж.
      </p>
    </SimpleCard>
  );
}

function SpecialityInfo() {
  return (
    <div className="column">
      <div className="columns">
        <Subjects />
        <GeneralInformation />
      </div>
      <BachelorInfo />
      <MasterInfo />
    </div>
  );
}

function PossibleCompany() {
  return (
    <>
      <h2 className="section-title">
        Де можуть працювати спеціалісти з комп’ютерної інженерії?
      </h2>
      <div className="column">
        <p className={styles.paragraph}>
          Велику увагу на кафедрі комп’ютерної інженерії та факультеті
          інформаційно-комп’ютерних технологій приділяють організації та
          проведенню всіх видів практик. Навчальним планом спеціальності 123
          «Комп’ютерна інженерія» передбачені наступні практики: навчальна,
          технологічна, виробнича, переддипломна.
        </p>
        <p className={styles.paragraph}>
          Навчальна та технологічна практики проходять під керівництвом
          провідних науково-педагогічних працівників кафедри на базі лабораторій
          кафедри та факультету. Виробнича та переддипломна практика орієнтовані
          на проходження на базі підприємств. При організації виробничої та
          передипломної практик особива увага приділяється вибору
          підприємств-баз практик та керівників практик від підприємств.
        </p>
        <p className={styles.paragraph}>
          Надається перевага сучасним високотехнологічним підприємствам та
          висококваліфікованим фахівцям-керівникам практик, які здатні
          забезпечити високоякісне та високоефективне проходження практик. За
          результатами проходження практик більшість студентів отримують
          пропозиції стосовно працевлаштування. Базами практики є провідні
          підприємства міста, області, України в діяльності яких широко
          застосовуються сучасні ІТ-технології.
        </p>
      </div>

      <FutureCareers />
    </>
  );
}

function PossibleJobRoles() {
  return (
    <>
      <h2 className="section-title">
        Ким можуть працювати спеціалісти з комп’ютерної інженерії?
      </h2>

      <div>
        <p className={styles.paragraph}>
          У межах фахової компетентності відбувається вивчення сучасної
          комп'ютерної електроніки та інших технічних засобів, структур та
          архітектур комп'ютерів, комп'ютерних комплексів та комп'ютерних мереж,
          операційних систем та середовищ, технології та мов програмування, баз
          даних та засобів управління ними, систем штучного інтелекту,
          кібербезпеки тощо.
        </p>
        <p className={styles.paragraph}>
          Завдання, пов’язані з комп’ютерною інженерією, включають написання
          програм і мікропрограм для вбудованих мікроконтролерів, проектування
          інтегральних схем, аналогових датчиків, плат змішаних сигналів.
          Комп’ютерні інженери також працюють над створенням прикладного та
          системного програмного забезпечення, розробкою розподілених
          інформаційних систем розробка операційних систем та сервісів для
          мобільних пристроїв, розробкою веб-додатків та сервісно-орієнтованих
          систем розробка, підтримкою та адміністрування баз даних,
          дослідженнями для робототехніки, які спираються на використанні
          цифрових систем для управління і контролю електричних систем, системи
          зв’язку та датчиків.
          <NewLine />
        </p>
      </div>

      <JobPositions />
      <NewLine />
    </>
  );
}

function NewLine() {
  return (
    <>
      <br />
      <br />
    </>
  );
}
